<?php 
if($connection -> real_connect($server,$user,$password,$db)){
    echo"<br>Соединились с базой данных $db.<br>";
}
$query = "REPLACE INTO sales (sale_id, product_id, staff_id, shopper_id, sale_date, sale_quantity, warranty_end_date, sale_price) VALUES 
(1, '7', '1', '1','2018-11-02','1','2019-11-02','8863.94'),
(2, '6', '2', '2','2018-11-07','2','2019-11-07','7659.15'),
(3, '5', '3', '3','2018-11-08','1','2019-11-08','22456.89'),
(4, '4', '4', '2','2018-11-10','1','2019-11-10','15956.41'),
(5, '3', '5', '1','2018-11-11','1','2019-11-11','8762.39'),
(6, '2', '6', '1','2018-11-12','4','2019-11-12','1245.77'),
(7, '1', '7', '3','2018-12-01','3','2019-12-01','8963.80'),
(8, '7', '1', '1','2018-12-03','1','2019-12-03','8863.94'),
(9, '6', '2', '2','2018-12-05','1','2019-12-05','7659.15'),
(10, '5', '3', '2','2018-12-08','2','2019-12-08','22456.89')
";

if($connection->query($query)===true){
    echo "Данные внесены успешно! (OOP)<br>";
    echo "Последний id: ". $connection -> insert_id;
} else {
    echo "Ошибка внесения данных (OOP): ".$connection->error;
}
// (NULL, '2', 'Шкаф', '8963.80'),
// (NULL, '3', 'Стул', '1245.77'),
// (NULL, '3', 'Стол', '8762.39'),
// (NULL, '1', 'Кровать', '15956.41'),
// (NULL, '1', 'Диван', '22456.89'),
// (NULL, '1', 'Кресло', '7659.15'),
// (NULL, '2', 'Комод', '8863.94')